; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c6-s6-p6-a4)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 
          c0 c1 c2 c3 c4 c5 
          t0 t1 t2 t3 t4 t5 t6 t7 
          l0-0 l0-1 l0-2 l0-3 l0-4 l0-5 l1-0 l1-1 l1-2 l1-3 l1-4 l1-5 l2-0 l2-1 l2-2 l2-3 l2-4 l2-5 l3-0 l3-1 l3-2 l3-3 l3-4 l3-5 l4-0 l4-1 l4-2 l4-3 l4-4 l4-5 l5-0 l5-1 l5-2 l5-3 l5-4 l5-5 
          p0 p1 p2 p3 p4 p5 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (AIRPLANE a3)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (CITY c5)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (TRUCK t6)
    (TRUCK t7)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l0-5)
    (in-city  l0-5 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l1-5)
    (in-city  l1-5 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l2-4)
    (in-city  l2-4 c2)
    (LOCATION l2-5)
    (in-city  l2-5 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l3-4)
    (in-city  l3-4 c3)
    (LOCATION l3-5)
    (in-city  l3-5 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l4-3)
    (in-city  l4-3 c4)
    (LOCATION l4-4)
    (in-city  l4-4 c4)
    (LOCATION l4-5)
    (in-city  l4-5 c4)
    (LOCATION l5-0)
    (in-city  l5-0 c5)
    (LOCATION l5-1)
    (in-city  l5-1 c5)
    (LOCATION l5-2)
    (in-city  l5-2 c5)
    (LOCATION l5-3)
    (in-city  l5-3 c5)
    (LOCATION l5-4)
    (in-city  l5-4 c5)
    (LOCATION l5-5)
    (in-city  l5-5 c5)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (AIRPORT l5-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (at t0 l0-2)
    (at t1 l1-4)
    (at t2 l2-5)
    (at t3 l3-4)
    (at t4 l4-3)
    (at t5 l5-3)
    (at t6 l4-0)
    (at t7 l1-5)
    (at p0 l0-5)
    (at p1 l3-5)
    (at p2 l0-4)
    (at p3 l1-1)
    (at p4 l5-0)
    (at p5 l2-2)
    (at a0 l5-0)
    (at a1 l0-0)
    (at a2 l5-0)
    (at a3 l3-0)
)
(:goal
    (and
        (at p0 l2-5)
        (at p1 l4-3)
        (at p2 l0-2)
        (at p3 l0-1)
        (at p4 l4-0)
        (at p5 l5-1)
    )
)

  (:constraints
    (and
      (always (not (in p2 a0)))
      (always (not (in p2 a1)))
      (always (not (in p2 a2)))
      (always (not (in p2 a3)))
    )
  )
)

; plan
1. (drive-truck t5 l5-3 l5-1 c5)
   deleted: (at t5 l5-3)
   added: (at t5 l5-1)
   goals met: 0 of 6
2. (drive-truck t3 l3-4 l3-5 c3)
   deleted: (at t3 l3-4)
   added: (at t3 l3-5)
   goals met: 0 of 6
3. (load-airplane p4 a0 l5-0)
   deleted: (at p4 l5-0)
   added: (in p4 a0)
   goals met: 0 of 6
4. (drive-truck t2 l2-5 l2-2 c2)
   deleted: (at t2 l2-5)
   added: (at t2 l2-2)
   goals met: 0 of 6
5. (drive-truck t1 l1-4 l1-1 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-1)
   goals met: 0 of 6
6. (drive-truck t7 l1-5 l1-1 c1)
   deleted: (at t7 l1-5)
   added: (at t7 l1-1)
   goals met: 0 of 6
7. (drive-truck t0 l0-2 l0-5 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-5)
   goals met: 0 of 6
8. (fly-airplane a1 l0-0 l3-0)
   deleted: (at a1 l0-0)
   added: (at a1 l3-0)
   goals met: 0 of 6
9. (fly-airplane a2 l5-0 l2-0)
   deleted: (at a2 l5-0)
   added: (at a2 l2-0)
   goals met: 0 of 6
10. (fly-airplane a3 l3-0 l1-0)
   deleted: (at a3 l3-0)
   added: (at a3 l1-0)
   goals met: 0 of 6
11. (drive-truck t4 l4-3 l4-0 c4)
   deleted: (at t4 l4-3)
   added: (at t4 l4-0)
   goals met: 0 of 6
12. (load-truck p1 t3 l3-5)
   deleted: (at p1 l3-5)
   added: (in p1 t3)
   goals met: 0 of 6
13. (fly-airplane a0 l5-0 l4-0)
   deleted: (at a0 l5-0)
   added: (at a0 l4-0)
   goals met: 0 of 6
14. (load-truck p5 t2 l2-2)
   deleted: (at p5 l2-2)
   added: (in p5 t2)
   goals met: 0 of 6
15. (load-truck p3 t1 l1-1)
   deleted: (at p3 l1-1)
   added: (in p3 t1)
   goals met: 0 of 6
16. (load-truck p0 t0 l0-5)
   deleted: (at p0 l0-5)
   added: (in p0 t0)
   goals met: 0 of 6
17. (drive-truck t5 l5-1 l5-0 c5)
   deleted: (at t5 l5-1)
   added: (at t5 l5-0)
   goals met: 0 of 6
18. (drive-truck t3 l3-5 l3-0 c3)
   deleted: (at t3 l3-5)
   added: (at t3 l3-0)
   goals met: 0 of 6
19. (unload-airplane p4 a0 l4-0)
   deleted: (in p4 a0)
   added: (at p4 l4-0)
   goals met: 1 of 6
20. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 1 of 6
21. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 1 of 6
22. (drive-truck t0 l0-5 l0-4 c0)
   deleted: (at t0 l0-5)
   added: (at t0 l0-4)
   goals met: 1 of 6
23. (unload-truck p1 t3 l3-0)
   deleted: (in p1 t3)
   added: (at p1 l3-0)
   goals met: 1 of 6
24. (unload-truck p5 t2 l2-0)
   deleted: (in p5 t2)
   added: (at p5 l2-0)
   goals met: 1 of 6
25. (unload-truck p3 t1 l1-0)
   deleted: (in p3 t1)
   added: (at p3 l1-0)
   goals met: 1 of 6
26. (load-truck p2 t0 l0-4)
   deleted: (at p2 l0-4)
   added: (in p2 t0)
   goals met: 1 of 6
27. (fly-airplane a0 l4-0 l0-0)
   deleted: (at a0 l4-0)
   added: (at a0 l0-0)
   goals met: 1 of 6
28. (drive-truck t0 l0-4 l0-1 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-1)
   goals met: 1 of 6
29. (load-airplane p1 a1 l3-0)
   deleted: (at p1 l3-0)
   added: (in p1 a1)
   goals met: 1 of 6
30. (load-airplane p5 a2 l2-0)
   deleted: (at p5 l2-0)
   added: (in p5 a2)
   goals met: 1 of 6
31. (load-airplane p3 a3 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a3)
   goals met: 1 of 6
32. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 1 of 6
33. (fly-airplane a1 l3-0 l5-0)
   deleted: (at a1 l3-0)
   added: (at a1 l5-0)
   goals met: 1 of 6
34. (fly-airplane a2 l2-0 l5-0)
   deleted: (at a2 l2-0)
   added: (at a2 l5-0)
   goals met: 1 of 6
35. (fly-airplane a3 l1-0 l0-0)
   deleted: (at a3 l1-0)
   added: (at a3 l0-0)
   goals met: 1 of 6
36. (unload-truck p0 t0 l0-0)
   deleted: (in p0 t0)
   added: (at p0 l0-0)
   goals met: 1 of 6
37. (fly-airplane a1 l5-0 l4-0)
   deleted: (at a1 l5-0)
   added: (at a1 l4-0)
   goals met: 1 of 6
38. (unload-airplane p5 a2 l5-0)
   deleted: (in p5 a2)
   added: (at p5 l5-0)
   goals met: 1 of 6
39. (unload-airplane p3 a3 l0-0)
   deleted: (in p3 a3)
   added: (at p3 l0-0)
   goals met: 1 of 6
40. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 1 of 6
41. (load-airplane p0 a0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a0)
   goals met: 1 of 6
42. (unload-airplane p1 a1 l4-0)
   deleted: (in p1 a1)
   added: (at p1 l4-0)
   goals met: 1 of 6
43. (load-truck p5 t5 l5-0)
   deleted: (at p5 l5-0)
   added: (in p5 t5)
   goals met: 1 of 6
44. (unload-truck p2 t0 l0-2)
   deleted: (in p2 t0)
   added: (at p2 l0-2)
   goals met: 2 of 6
45. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 2 of 6
46. (load-truck p1 t4 l4-0)
   deleted: (at p1 l4-0)
   added: (in p1 t4)
   goals met: 2 of 6
47. (drive-truck t5 l5-0 l5-1 c5)
   deleted: (at t5 l5-0)
   added: (at t5 l5-1)
   goals met: 2 of 6
48. (drive-truck t4 l4-0 l4-3 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-3)
   goals met: 2 of 6
49. (unload-truck p5 t5 l5-1)
   deleted: (in p5 t5)
   added: (at p5 l5-1)
   goals met: 3 of 6
50. (drive-truck t0 l0-2 l0-1 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-1)
   goals met: 3 of 6
51. (unload-airplane p0 a0 l2-0)
   deleted: (in p0 a0)
   added: (at p0 l2-0)
   goals met: 3 of 6
52. (load-truck p0 t2 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 t2)
   goals met: 3 of 6
53. (unload-truck p1 t4 l4-3)
   deleted: (in p1 t4)
   added: (at p1 l4-3)
   goals met: 4 of 6
54. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 4 of 6
55. (drive-truck t2 l2-0 l2-5 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-5)
   goals met: 4 of 6
56. (load-truck p3 t0 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 4 of 6
57. (unload-truck p0 t2 l2-5)
   deleted: (in p0 t2)
   added: (at p0 l2-5)
   goals met: 5 of 6
58. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 5 of 6
59. (unload-truck p3 t0 l0-1)
   deleted: (in p3 t0)
   added: (at p3 l0-1)
   goals met: 6 of 6
